import type {FarmFeatureCollection} from "../src/dtos/FarmFeature.ts";
import type {InterestType} from "../src/dtos/InterestType.ts";


export const mockData: FarmFeatureCollection = {
    type: 'FeatureCollection',
    features: [
        {
            type: 'Feature',
            properties: {
                id: 'field-1',
                name: 'Поле №1 - Пшениця',
                area: 45.2,
                crop: 'Пшениця',
            },
            geometry: {
                type: 'Polygon',
                coordinates: [
                    [
                        [30.5234, 50.4501],
                        [30.5334, 50.4501],
                        [30.5334, 50.4601],
                        [30.5234, 50.4601],
                        [30.5234, 50.4501],
                    ],
                ],
            },
        },
        {
            type: 'Feature',
            properties: {
                id: 'park-1',
                name: 'Парк імені Тараса Шевченка',
                area: 5.4,
                crop: 'Дерева!'
            },
            geometry: {
                type: 'Polygon',
                coordinates: [
                    [
                        [
                            30.51252673176421,
                            50.44333733715402
                        ],
                        [
                            30.511330900628423,
                            50.44048565345744
                        ],
                        [
                            30.51364284082362,
                            50.44008792724131
                        ],
                        [
                            30.514772236896306,
                            50.443024252681624
                        ],
                        [
                            30.51252673176421,
                            50.44333733715402
                        ]
                    ]
                ]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'park-2',
                name: 'Маріїнський парк',
                area: 14.6,
                crop: 'Дерева!'
            },
            geometry: {
                type: 'Polygon',
                coordinates: [
                    [
                        [
                            30.53737667975409,
                            50.446793824934986
                        ],
                        [
                            30.537376679736667,
                            50.44685864217365
                        ],
                        [
                            30.539431000566424,
                            50.448286988784446
                        ],
                        [
                            30.543477925310327,
                            50.44592969430886
                        ],
                        [
                            30.541736806525165,
                            50.44437141823815
                        ],
                        [
                            30.539415314811805,
                            50.44560006326566
                        ],
                        [
                            30.5373447951755,
                            50.44678872199697
                        ],
                        [
                            30.537376166685704,
                            50.44683866498755
                        ],
                        [
                            30.537360480931028,
                            50.446808699199295
                        ],
                        [
                            30.537360480931028,
                            50.44683866498755
                        ],
                        [
                            30.53737667975409,
                            50.446793824934986
                        ]
                    ]
                ]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'park-4',
                name: 'Голосіївський парк імені Максима Рильського',
                area: 140.9,
                crop: 'Дерева!'
            },
            geometry: {
                type: 'Polygon',
                coordinates: [
                    [
                        [
                            30.51028172040236,
                            50.39713064874232
                        ],
                        [
                            30.524523007138356,
                            50.39052779816393
                        ],
                        [
                            30.523968151811033,
                            50.389977519105855
                        ],
                        [
                            30.525077862466617,
                            50.38919139508744
                        ],
                        [
                            30.523228344708258,
                            50.38871971442077
                        ],
                        [
                            30.514289008877938,
                            50.38679363633494
                        ],
                        [
                            30.51250114171171,
                            50.38797287710236
                        ],
                        [
                            30.506212781334682,
                            50.38608607779864
                        ],
                        [
                            30.504918118904527,
                            50.384356445821254
                        ],
                        [
                            30.49431421709221,
                            50.38408127128105
                        ],
                        [
                            30.494190915908007,
                            50.38325573808169
                        ],
                        [
                            30.490553530984272,
                            50.383019868813705
                        ],
                        [
                            30.491354988679205,
                            50.38640054956301
                        ],
                        [
                            30.506212781334682,
                            50.392453724575546
                        ],
                        [
                            30.51022006981026,
                            50.39724854843092
                        ],
                        [
                            30.51028172040236,
                            50.39713064874232
                        ]
                    ]
                ]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'park-5',
                name: 'Парк Феофанія',
                area: 150,
                crop: 'Дерева!'
            },
            geometry: {
                type: 'Polygon',
                coordinates: [
                    [
                        [
                            30.48067475733086,
                            50.3501096831593
                        ],
                        [
                            30.485822976948214,
                            50.35048157432723
                        ],
                        [
                            30.489222744621316,
                            50.348808041135015
                        ],
                        [
                            30.492622512293025,
                            50.348312168121595
                        ],
                        [
                            30.493691010704907,
                            50.350729500154074
                        ],
                        [
                            30.499130638980745,
                            50.34763033427291
                        ],
                        [
                            30.501947589336822,
                            50.344221018176995
                        ],
                        [
                            30.505347357009953,
                            50.33603766093103
                        ],
                        [
                            30.497382187035214,
                            50.332875531679434
                        ],
                        [
                            30.490776924127886,
                            50.33535565085492
                        ],
                        [
                            30.484560206098735,
                            50.33591365982727
                        ],
                        [
                            30.485143023414423,
                            50.33355757735876
                        ],
                        [
                            30.481743255741293,
                            50.33485963737695
                        ],
                        [
                            30.480189076234723,
                            50.333247557809045
                        ],
                        [
                            30.47542940149262,
                            50.33330956188101
                        ],
                        [
                            30.47416663064311,
                            50.33628566216751
                        ],
                        [
                            30.478246351850032,
                            50.33622366198
                        ],
                        [
                            30.478634896726703,
                            50.334921639345055
                        ],
                        [
                            30.482714617933595,
                            50.339881534613454
                        ],
                        [
                            30.481840391960787,
                            50.342547264343665
                        ],
                        [
                            30.480577621111394,
                            50.34316718004854
                        ],
                        [
                            30.47853776050715,
                            50.345336821297224
                        ],
                        [
                            30.47912057782287,
                            50.34781628992951
                        ],
                        [
                            30.48067475733086,
                            50.3501096831593
                        ]
                    ]
                ]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'park-6',
                name: 'Парк Нивки (східна частина)',
                area: 46.1,
                crop: 'Дерева!'
            },
            geometry: {
                type: 'Polygon',
                coordinates: [[
                    [30.3970, 50.4600],
                    [30.4030, 50.4580],
                    [30.4140, 50.4590],
                    [30.4230, 50.4630],
                    [30.4250, 50.4690],
                    [30.4200, 50.4750],
                    [30.4100, 50.4770],
                    [30.4010, 50.4730],
                    [30.3970, 50.4670],
                    [30.3970, 50.4600]
                ]]
            }
        },
        // Mock points
        {
            type: 'Feature',
            properties: {
                id: 'poi-1',
                name: 'Проблема з ґрунтом',
                type: 'SoilTest' as InterestType,
                description: 'Помічено надмірну вологість ґрунту після дощів.',
                createDate: new Date('2026-10-01T10:00:00Z')
            },
            geometry: {
                type: 'Point',
                coordinates: [30.5284, 50.4551]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'poi-2',
                name: 'Жуки на краях',
                type: "Pests" as InterestType,
                description: 'Знайдено колонію невідомих жуків.',
                createDate: new Date('2026-10-02T14:30:00Z')
            },
            geometry: {
                type: 'Point',
                coordinates: [30.5120, 50.4410]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'poi-3',
                name: 'Пляма на листі',
                type: 'PlantDiseases' as InterestType,
                description: 'Рослини мають жовті плями, можливо грибок.',
                createDate: new Date('2026-10-03T09:15:00Z')
            },
            geometry: {
                type: 'Point',
                coordinates: [30.4100, 50.4650]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'poi-4',
                name: 'Інше точка цікавості',
                type: 'Other' as InterestType,
                description: 'Інша дивність на карті',
                createDate: new Date('2026-10-04T09:15:00Z')
            },
            geometry: {
                type: 'Point',
                coordinates: [30.54045, 50.44668]
            }
        },
        {
            type: 'Feature',
            properties: {
                id: 'poi-5',
                name: 'Хворе листя',
                type: 'PlantDiseases' as InterestType,
                description: 'Хвороби рослин',
                createDate: new Date('2026-10-06T09:15:00Z')
            },
            geometry: {
                type: 'Point',
                coordinates: [30.52925, 50.45130]
            }
        },
    ]
};
